In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv(r'C:\Users\Surface Pro\Desktop\ENTRI APP\phython\seaborn-matplotlib\tourism_data.csv')
df.head(1)

  LocationID Country    Category  Visitors  Rating
0      L0001   Egypt  City Break   4094924     1.7

In [ ]:
1.
Top 5 Countries by Total Visitors:
Identify the top 5 countries with the highest total number of visitors.
The result should be a list of dictionaries, where each dictionary contains the 'Country' name and the 'Total_Visitors'.

In [10]:
top_5_countries = df.groupby('Country')['Visitors'].sum().nlargest(5).sort_values(ascending=False)
top_5_countries

Country
India           159013770
France          151257005
South Africa    149498186
Egypt           144341427
Turkey          142451805
Name: Visitors, dtype: int64

In [8]:
top5countryvisitors = {'country' : ['India', 'France', 'South Africa', 'Egypt', 'Turkey'], 
                       'total_visitors' : [159013770, 151257005, 149498186, 144341427, 142451805]} 
top5countryvisitors

{'country': ['India', 'France', 'South Africa', 'Egypt', 'Turkey'],
 'total_visitors': [159013770, 151257005, 149498186, 144341427, 142451805]}

______________

In [ ]:
Average Rating per Category:
Calculate the average rating for each Category.
The result should be a dictionary where the keys are the Category names and the values are their corresponding average ratings, 
rounded to two decimal places.

In [11]:
df.head(1)

  LocationID Country    Category  Visitors  Rating
0      L0001   Egypt  City Break   4094924     1.7

In [14]:
average_rating_per_categeory = df.groupby('Category')['Rating'].mean().round(2).sort_values()
average_rating_per_categeory

Category
Skiing        2.87
City Break    2.93
Beach         2.94
Nature        2.95
Historical    3.02
Cultural      3.05
Adventure     3.14
Name: Rating, dtype: float64

In [15]:
avg_ratingPerCategeory = {'categeory' : ['skiing', 'city break', 'beach', 'nature', 'historical', 'cultural', 'adventure'],
                          'rating' : [2.87, 2.93, 2.94, 2.95, 3.02, 3.05, 3.14]}
avg_ratingPerCategeory

{'categeory': ['skiing',
  'city break',
  'beach',
  'nature',
  'historical',
  'cultural',
  'adventure'],
 'rating': [2.87, 2.93, 2.94, 2.95, 3.02, 3.05, 3.14]}

__________

In [ ]:
3. Country with the Highest-Rated Location:
Find the country that has the single highest-rated tourist location.
Return a dictionary with the 'Country' and the 'Location' name of this highest-rated spot.
If there's a tie, any one of the tied locations is an acceptable answer.

In [22]:
df.head(1)

  LocationID Country    Category  Visitors  Rating
0      L0001   Egypt  City Break   4094924     1.7

In [27]:
df.loc[df['Rating'].idxmax()]

LocationID       L0004
Country        Germany
Category      Cultural
Visitors       1410578
Rating             5.0
Name: 3, dtype: object

In [29]:
highest_rated_spot = { 'country' :'Germany', 'location' : 'cultural' } 
highest_rated_spot

{'country': 'Germany', 'location': 'cultural'}

___________

In [ ]:
Correlation between Visitors and Rating:

Calculate the Pearson correlation coefficient between the 'Visitors' and 'Rating' columns.
The result should be a single floating-point number, rounded to three decimal places.

In [30]:
df.head(1)

  LocationID Country    Category  Visitors  Rating
0      L0001   Egypt  City Break   4094924     1.7

In [36]:
df['Visitors'].corr(df['Rating']).round(3)

-0.053

____________

## Retail Sales Data Analysis

In [5]:
df1 = pd.read_csv(r'C:\Users\Surface Pro\Desktop\ENTRI APP\phython\seaborn-matplotlib\retail_sales.csv')
df1.head(1)

,OrderID,ProductID,Category,Quantity,UnitPrice,CustomerID,Date
0,1,P124,Food & Beverage,3,73.89,C0407,2025-07-26

In [ ]:
•Top3 Best-Selling Categories:

Find the top 3 product categories based on the total revenue they generated.
The result should be a list of dictionaries, where each dictionary contains the 'Category' name and the 'Total_Revenue',
rounded to two decimal places.

In [13]:
df1['Total_Revenue'] = df1['Quantity'] * df1['UnitPrice']
df1.head(1)

,OrderID,ProductID,Category,Quantity,UnitPrice,CustomerID,Date,Total_Revenue
0,1,P124,Food & Beverage,3,73.89,C0407,2025-07-26,221.67

In [41]:
categeoryperrevenue = df1.groupby('Category')['Total_Revenue'].sum()

In [45]:
top3categoryperrevenue = categeoryperrevenue.nlargest(3).sort_values(ascending=False).round(2)
top3categoryperrevenue

Category
Apparel       263648.72
Beauty        247853.21
Home Goods    232926.31
Name: Total_Revenue, dtype: float64

In [47]:
top3catrev = { 'Category' : ['Apparel', 'Beauty', 'Home Goods'], 'Revenue' : [263648.72, 247853.21, 232926.31]}
top3catrev

{'Category': ['Apparel', 'Beauty', 'Home Goods'],
 'Revenue': [263648.72, 247853.21, 232926.31]}

_____________

In [ ]:
Average Order Value (AOV):

Calculate the average total value of an order.
The result should be a single float value, rounded to two decimal places. 
You will need to calculate the total value for each OrderID first.

In [6]:
df1.head(1)

,OrderID,ProductID,Category,Quantity,UnitPrice,CustomerID,Date
0,1,P124,Food & Beverage,3,73.89,C0407,2025-07-26

In [11]:
no_of_orders = df1['OrderID'].count()
no_of_orders

1000

In [14]:
sum_of_total_revenue = df1['Total_Revenue'].sum()
sum_of_total_revenue

1366703.83

In [15]:
AOV = sum_of_total_revenue / no_of_orders
AOV.round(2)

1366.7

------

In [16]:
Most Frequent Customer:

Identify the CustomerID who made the most number of purchases (i.e., the most number of distinct OrderIDs).
Return a dictionary with the 'CustomerID' and the 'Number_of_Orders' they placed.

SyntaxError: invalid syntax (3633831918.py, line 1)

In [57]:
df1.head(1)

,OrderID,ProductID,Category,Quantity,UnitPrice,CustomerID,Date,Total_Revenue
0,1,P124,Food & Beverage,3,73.89,C0407,2025-07-26,221.67

In [66]:
cust_order = df1.groupby('CustomerID')['OrderID'].nunique()

In [62]:
cust_order.idxmax()

'C0049'

In [65]:
cust_order.max()

6

In [67]:
most_frequent_customer = {'customerid' : 'C0049', 'number_of_orders' : 6}

______

In [ ]:
* category for highest revenvue

In [75]:
df1.loc[df1['Category'].idxmax()]

OrderID                   6
ProductID              P053
Category         Home Goods
Quantity                  9
UnitPrice            354.15
CustomerID            C0033
Date             2024-12-12
Total_Revenue       3187.35
Name: 5, dtype: object

In [74]:
df1.loc[df1['Category'].idxmin()]

OrderID                  19
ProductID              P148
Category            Apparel
Quantity                  9
UnitPrice            459.79
CustomerID            C0133
Date             2024-11-11
Total_Revenue       4138.11
Name: 18, dtype: object

In [73]:
df1.loc[df1['CustomerID'].idxmax()]

OrderID                  86
ProductID              P051
Category            Apparel
Quantity                 10
UnitPrice            416.88
CustomerID            C0500
Date             2025-02-07
Total_Revenue        4168.8
Name: 85, dtype: object

In [76]:
df1.head(1)

,OrderID,ProductID,Category,Quantity,UnitPrice,CustomerID,Date,Total_Revenue
0,1,P124,Food & Beverage,3,73.89,C0407,2025-07-26,221.67

In [79]:
df1.loc[df1['CustomerID'].idxmin()]

OrderID                  31
ProductID              P078
Category              Books
Quantity                  6
UnitPrice            451.47
CustomerID            C0001
Date             2024-11-23
Total_Revenue       2708.82
Name: 30, dtype: object

In [82]:
df1.loc[df1['Quantity'].idxmin()]

OrderID                        2
ProductID                   P119
Category         Food & Beverage
Quantity                       1
UnitPrice                 196.59
CustomerID                 C0178
Date                  2025-02-12
Total_Revenue             196.59
Name: 1, dtype: object

In [ ]:
Sales Trend Over Time:

Calculate the total revenue for each month and year.
    
The result should be a dictionary where the keys are a Year-Month string (e.g., '2024-01') and the values are the total revenue for that period, 
    rounded to two decimal places.
    
You will need to use pandas to extract the year and month from the Date column.

In [84]:
df1.head(1)

,OrderID,ProductID,Category,Quantity,UnitPrice,CustomerID,Date,Total_Revenue
0,1,P124,Food & Beverage,3,73.89,C0407,2025-07-26,221.67

In [90]:
df1['Date'] = pd.to_datetime(df1['Date'])

In [92]:
df1['Month'] = df1['Date'].dt.month

In [105]:
df1['Year'] = df1['Date'].dt.year

In [107]:
df1['Year-Month'] = df1['Year'].astype(str)+'-'+df1['Month'].astype(str)

In [108]:
df1.head(1)

,OrderID,ProductID,Category,Quantity,UnitPrice,CustomerID,Date,Total_Revenue,Month,Year,Year-Month
0,1,P124,Food & Beverage,3,73.89,C0407,2025-07-26,221.67,7,2025,2025-7

In [114]:
df1.groupby('Year-Month')['Total_Revenue'].sum().round(2)

Year-Month
2024-10    108752.11
2024-11    112093.03
2024-12    136301.90
2024-8     102144.79
2024-9     131848.01
2025-1     102097.57
2025-2      90980.56
2025-3     126556.54
2025-4      86597.07
2025-5     112506.20
2025-6     111257.68
2025-7     115851.76
2025-8      29716.61
Name: Total_Revenue, dtype: float64

In [119]:
year_month_revenue = {'Year-month' : [2024-10, 2024-11, 2024-12, 2024-8, 2024-9, 2025-1, 2025-2, 2025-3, 2025-4, 2025-5, 2025-6, 2025-7, 2025-8],
                      'total_revenue' : [108752.11, 112093.03, 136301.90, 102144.79, 131848.01, 102097.57, 90980.56, 126556.54, 86597.07, 
                                         112506.20, 111257.68,  115851.76,29716.61]}

__________

## E-commerce Customer Data Analysis

In [123]:
df2 = pd.read_csv(r'C:\Users\Surface Pro\Desktop\ENTRI APP\phython\seaborn-matplotlib\customers.csv')
df2.head(1)

   customer_id        name                   email  age     city   join_date
0            1  Customer_1  customer_1@example.com   56  Chicago  2022-08-04

In [122]:
df3 = pd.read_csv(r'C:\Users\Surface Pro\Desktop\ENTRI APP\phython\seaborn-matplotlib\orders.csv')

In [125]:
df_merged = pd.merge(df2, df3, on = 'customer_id')
df_merged.head(1)

,customer_id,name,email,age,city,join_date,order_id,order_date,product_category,total_price
0,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,82,2023-03-15,Electronics,388.0

In [ ]:
Advanced Customer Behavior Analysis:
•
Identify customers who have made more than 5 orders. List their customer_id and the total number of orders they made.
•
For each month of the year, calculate the total revenue.
•
Find the average total_price of orders for customers older than 40.

In [127]:
df_merged.head(1)

,customer_id,name,email,age,city,join_date,order_id,order_date,product_category,total_price
0,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,82,2023-03-15,Electronics,388.0

In [ ]:
Identify customers who have made more than 5 orders. List their customer_id and the total number of orders they made.

In [139]:
name_order_count = df_merged.groupby('name')['order_id'].count()
name_order_count

name
Customer_1       9
Customer_10      5
Customer_100     4
Customer_1000    2
Customer_101     5
                ..
Customer_995     2
Customer_996     4
Customer_997     2
Customer_998     3
Customer_999     4
Name: order_id, Length: 990, dtype: int64

In [144]:
filter_cust_morethan5orders = name_order_count[name_order_count > 5].reset_index()
filter_cust_morethan5orders

             name  order_id
0      Customer_1         9
1    Customer_104         8
2    Customer_109        10
3    Customer_111        12
4    Customer_112         8
..            ...       ...
385  Customer_984         6
386  Customer_986         6
387  Customer_988        10
388  Customer_991         6
389  Customer_992         7

[390 rows x 2 columns]

In [152]:
orders5cust = filter_cust_morethan5orders.to_dict('records')
orders5cust

[{'name': 'Customer_1', 'order_id': 9},
 {'name': 'Customer_104', 'order_id': 8},
 {'name': 'Customer_109', 'order_id': 10},
 {'name': 'Customer_111', 'order_id': 12},
 {'name': 'Customer_112', 'order_id': 8},
 {'name': 'Customer_113', 'order_id': 7},
 {'name': 'Customer_116', 'order_id': 7},
 {'name': 'Customer_118', 'order_id': 8},
 {'name': 'Customer_12', 'order_id': 7},
 {'name': 'Customer_124', 'order_id': 6},
 {'name': 'Customer_125', 'order_id': 7},
 {'name': 'Customer_126', 'order_id': 6},
 {'name': 'Customer_127', 'order_id': 8},
 {'name': 'Customer_128', 'order_id': 6},
 {'name': 'Customer_129', 'order_id': 7},
 {'name': 'Customer_13', 'order_id': 9},
 {'name': 'Customer_134', 'order_id': 6},
 {'name': 'Customer_137', 'order_id': 9},
 {'name': 'Customer_139', 'order_id': 7},
 {'name': 'Customer_141', 'order_id': 9},
 {'name': 'Customer_144', 'order_id': 6},
 {'name': 'Customer_147', 'order_id': 8},
 {'name': 'Customer_154', 'order_id': 8},
 {'name': 'Customer_155', 'order_id': 7},
 {'name': 'Customer_156', 'order_id': 10},
 {'name': 'Customer_162', 'order_id': 6},
 {'name': 'Customer_164', 'order_id': 9},
 {'name': 'Customer_166', 'order_id': 8},
 {'name': 'Customer_171', 'order_id': 9},
 {'name': 'Customer_175', 'order_id': 9},
 {'name': 'Customer_177', 'order_id': 6},
 {'name': 'Customer_179', 'order_id': 7},
 {'name': 'Customer_181', 'order_id': 7},
 {'name': 'Customer_183', 'order_id': 6},
 {'name': 'Customer_184', 'order_id': 7},
 {'name': 'Customer_185', 'order_id': 6},
 {'name': 'Customer_187', 'order_id': 8},
 {'name': 'Customer_188', 'order_id': 10},
 {'name': 'Customer_189', 'order_id': 6},
 {'name': 'Customer_19', 'order_id': 8},
 {'name': 'Customer_190', 'order_id': 7},
 {'name': 'Customer_191', 'order_id': 9},
 {'name': 'Customer_192', 'order_id': 7},
 {'name': 'Customer_193', 'order_id': 7},
 {'name': 'Customer_194', 'order_id': 8},
 {'name': 'Customer_195', 'order_id': 10},
 {'name': 'Customer_201', 'order_id': 10},
 {'name': 'Customer_206', 'order_id': 8},
 {'name': 'Customer_207', 'order_id': 9},
 {'name': 'Customer_210', 'order_id': 6},
 {'name': 'Customer_211', 'order_id': 7},
 {'name': 'Customer_214', 'order_id': 6},
 {'name': 'Customer_215', 'order_id': 6},
 {'name': 'Customer_218', 'order_id': 6},
 {'name': 'Customer_22', 'order_id': 8},
 {'name': 'Customer_222', 'order_id': 6},
 {'name': 'Customer_227', 'order_id': 6},
 {'name': 'Customer_232', 'order_id': 6},
 {'name': 'Customer_233', 'order_id': 6},
 {'name': 'Customer_235', 'order_id': 7},
 {'name': 'Customer_237', 'order_id': 10},
 {'name': 'Customer_239', 'order_id': 7},
 {'name': 'Customer_245', 'order_id': 8},
 {'name': 'Customer_247', 'order_id': 11},
 {'name': 'Customer_248', 'order_id': 6},
 {'name': 'Customer_25', 'order_id': 10},
 {'name': 'Customer_256', 'order_id': 6},
 {'name': 'Customer_260', 'order_id': 7},
 {'name': 'Customer_262', 'order_id': 6},
 {'name': 'Customer_265', 'order_id': 7},
 {'name': 'Customer_268', 'order_id': 7},
 {'name': 'Customer_269', 'order_id': 6},
 {'name': 'Customer_270', 'order_id': 6},
 {'name': 'Customer_271', 'order_id': 6},
 {'name': 'Customer_273', 'order_id': 8},
 {'name': 'Customer_276', 'order_id': 7},
 {'name': 'Customer_277', 'order_id': 6},
 {'name': 'Customer_278', 'order_id': 7},
 {'name': 'Customer_283', 'order_id': 11},
 {'name': 'Customer_287', 'order_id': 6},
 {'name': 'Customer_294', 'order_id': 7},
 {'name': 'Customer_296', 'order_id': 7},
 {'name': 'Customer_30', 'order_id': 6},
 {'name': 'Customer_302', 'order_id': 6},
 {'name': 'Customer_303', 'order_id': 7},
 {'name': 'Customer_304', 'order_id': 7},
 {'name': 'Customer_313', 'order_id': 8},
 {'name': 'Customer_314', 'order_id': 8},
 {'name': 'Customer_315', 'order_id': 6},
 {'name': 'Customer_317', 'order_id': 7},
 {'name': 'Customer_325', 'order_id': 6},
 {'name': 'Customer_327', 'order_id': 9},
 {'name': 'Customer_331', 'order_id': 10},
 {'name': 'Customer_333', 'order_id': 6},
 {'name': 'Customer_335', 'order_id': 6},
 {'name': 'Customer_337', 'order_id': 6},
 {'name': 'Customer_338', 'order_id': 6},
 {'name': 'Customer_339', 'order_id': 6},
 {'name': 'Customer_340', 'order_id': 7},
 {'name': 'Customer_343', 'order_id': 10},
 {'name': 'Customer_345', 'order_id': 7},
 {'name': 'Customer_348', 'order_id': 6},
 {'name': 'Customer_35', 'order_id': 7},
 {'name': 'Customer_354', 'order_id': 6},
 {'name': 'Customer_355', 'order_id': 11},
 {'name': 'Customer_361', 'order_id': 6},
 {'name': 'Customer_363', 'order_id': 6},
 {'name': 'Customer_364', 'order_id': 9},
 {'name': 'Customer_366', 'order_id': 6},
 {'name': 'Customer_367', 'order_id': 9},
 {'name': 'Customer_368', 'order_id': 6},
 {'name': 'Customer_369', 'order_id': 7},
 {'name': 'Customer_375', 'order_id': 9},
 {'name': 'Customer_376', 'order_id': 8},
 {'name': 'Customer_378', 'order_id': 6},
 {'name': 'Customer_381', 'order_id': 6},
 {'name': 'Customer_383', 'order_id': 8},
 {'name': 'Customer_384', 'order_id': 8},
 {'name': 'Customer_387', 'order_id': 9},
 {'name': 'Customer_388', 'order_id': 8},
 {'name': 'Customer_39', 'order_id': 6},
 {'name': 'Customer_390', 'order_id': 9},
 {'name': 'Customer_401', 'order_id': 9},
 {'name': 'Customer_41', 'order_id': 7},
 {'name': 'Customer_412', 'order_id': 8},
 {'name': 'Customer_414', 'order_id': 7},
 {'name': 'Customer_416', 'order_id': 6},
 {'name': 'Customer_419', 'order_id': 7},
 {'name': 'Customer_420', 'order_id': 8},
 {'name': 'Customer_421', 'order_id': 9},
 {'name': 'Customer_424', 'order_id': 7},
 {'name': 'Customer_427', 'order_id': 6},
 {'name': 'Customer_428', 'order_id': 6},
 {'name': 'Customer_429', 'order_id': 9},
 {'name': 'Customer_431', 'order_id': 6},
 {'name': 'Customer_432', 'order_id': 6},
 {'name': 'Customer_434', 'order_id': 7},
 {'name': 'Customer_438', 'order_id': 8},
 {'name': 'Customer_439', 'order_id': 11},
 {'name': 'Customer_44', 'order_id': 6},
 {'name': 'Customer_441', 'order_id': 8},
 {'name': 'Customer_443', 'order_id': 9},
 {'name': 'Customer_444', 'order_id': 6},
 {'name': 'Customer_445', 'order_id': 6},
 {'name': 'Customer_446', 'order_id': 6},
 {'name': 'Customer_45', 'order_id': 6},
 {'name': 'Customer_450', 'order_id': 9},
 {'name': 'Customer_451', 'order_id': 8},
 {'name': 'Customer_452', 'order_id': 8},
 {'name': 'Customer_453', 'order_id': 6},
 {'name': 'Customer_457', 'order_id': 6},
 {'name': 'Customer_465', 'order_id': 7},
 {'name': 'Customer_467', 'order_id': 6},
 {'name': 'Customer_471', 'order_id': 11},
 {'name': 'Customer_474', 'order_id': 6},
 {'name': 'Customer_48', 'order_id': 6},
 {'name': 'Customer_480', 'order_id': 10},
 {'name': 'Customer_481', 'order_id': 8},
 {'name': 'Customer_483', 'order_id': 6},
 {'name': 'Customer_485', 'order_id': 7},
 {'name': 'Customer_487', 'order_id': 6},
 {'name': 'Customer_489', 'order_id': 7},
 {'name': 'Customer_49', 'order_id': 6},
 {'name': 'Customer_490', 'order_id': 8},
 {'name': 'Customer_491', 'order_id': 7},
 {'name': 'Customer_494', 'order_id': 10},
 {'name': 'Customer_495', 'order_id': 7},
 {'name': 'Customer_496', 'order_id': 6},
 {'name': 'Customer_499', 'order_id': 9},
 {'name': 'Customer_50', 'order_id': 7},
 {'name': 'Customer_500', 'order_id': 6},
 {'name': 'Customer_503', 'order_id': 6},
 {'name': 'Customer_504', 'order_id': 7},
 {'name': 'Customer_505', 'order_id': 7},
 {'name': 'Customer_508', 'order_id': 8},
 {'name': 'Customer_509', 'order_id': 7},
 {'name': 'Customer_511', 'order_id': 7},
 {'name': 'Customer_514', 'order_id': 6},
 {'name': 'Customer_518', 'order_id': 6},
 {'name': 'Customer_519', 'order_id': 6},
 {'name': 'Customer_520', 'order_id': 8},
 {'name': 'Customer_523', 'order_id': 7},
 {'name': 'Customer_525', 'order_id': 6},
 {'name': 'Customer_528', 'order_id': 10},
 {'name': 'Customer_529', 'order_id': 6},
 {'name': 'Customer_530', 'order_id': 8},
 {'name': 'Customer_533', 'order_id': 7},
 {'name': 'Customer_537', 'order_id': 6},
 {'name': 'Customer_54', 'order_id': 6},
 {'name': 'Customer_540', 'order_id': 12},
 {'name': 'Customer_541', 'order_id': 6},
 {'name': 'Customer_542', 'order_id': 9},
 {'name': 'Customer_547', 'order_id': 6},
 {'name': 'Customer_549', 'order_id': 8},
 {'name': 'Customer_550', 'order_id': 7},
 {'name': 'Customer_551', 'order_id': 8},
 {'name': 'Customer_553', 'order_id': 6},
 {'name': 'Customer_557', 'order_id': 7},
 {'name': 'Customer_558', 'order_id': 10},
 {'name': 'Customer_559', 'order_id': 10},
 {'name': 'Customer_560', 'order_id': 8},
 {'name': 'Customer_563', 'order_id': 7},
 {'name': 'Customer_566', 'order_id': 7},
 {'name': 'Customer_567', 'order_id': 6},
 {'name': 'Customer_571', 'order_id': 8},
 {'name': 'Customer_573', 'order_id': 8},
 {'name': 'Customer_574', 'order_id': 6},
 {'name': 'Customer_575', 'order_id': 7},
 {'name': 'Customer_582', 'order_id': 8},
 {'name': 'Customer_584', 'order_id': 6},
 {'name': 'Customer_588', 'order_id': 7},
 {'name': 'Customer_589', 'order_id': 6},
 {'name': 'Customer_59', 'order_id': 9},
 {'name': 'Customer_596', 'order_id': 7},
 {'name': 'Customer_6', 'order_id': 6},
 {'name': 'Customer_601', 'order_id': 6},
 {'name': 'Customer_602', 'order_id': 6},
 {'name': 'Customer_605', 'order_id': 6},
 {'name': 'Customer_606', 'order_id': 10},
 {'name': 'Customer_607', 'order_id': 8},
 {'name': 'Customer_608', 'order_id': 6},
 {'name': 'Customer_610', 'order_id': 6},
 {'name': 'Customer_611', 'order_id': 9},
 {'name': 'Customer_613', 'order_id': 6},
 {'name': 'Customer_615', 'order_id': 6},
 {'name': 'Customer_616', 'order_id': 6},
 {'name': 'Customer_618', 'order_id': 8},
 {'name': 'Customer_620', 'order_id': 7},
 {'name': 'Customer_621', 'order_id': 7},
 {'name': 'Customer_622', 'order_id': 8},
 {'name': 'Customer_628', 'order_id': 8},
 {'name': 'Customer_629', 'order_id': 6},
 {'name': 'Customer_630', 'order_id': 7},
 {'name': 'Customer_634', 'order_id': 6},
 {'name': 'Customer_638', 'order_id': 7},
 {'name': 'Customer_639', 'order_id': 6},
 {'name': 'Customer_645', 'order_id': 6},
 {'name': 'Customer_646', 'order_id': 7},
 {'name': 'Customer_65', 'order_id': 8},
 {'name': 'Customer_650', 'order_id': 8},
 {'name': 'Customer_651', 'order_id': 6},
 {'name': 'Customer_653', 'order_id': 7},
 {'name': 'Customer_658', 'order_id': 11},
 {'name': 'Customer_659', 'order_id': 8},
 {'name': 'Customer_660', 'order_id': 7},
 {'name': 'Customer_661', 'order_id': 8},
 {'name': 'Customer_662', 'order_id': 8},
 {'name': 'Customer_663', 'order_id': 7},
 {'name': 'Customer_666', 'order_id': 6},
 {'name': 'Customer_669', 'order_id': 6},
 {'name': 'Customer_674', 'order_id': 7},
 {'name': 'Customer_675', 'order_id': 8},
 {'name': 'Customer_679', 'order_id': 6},
 {'name': 'Customer_68', 'order_id': 6},
 {'name': 'Customer_681', 'order_id': 6},
 {'name': 'Customer_685', 'order_id': 10},
 {'name': 'Customer_687', 'order_id': 7},
 {'name': 'Customer_688', 'order_id': 7},
 {'name': 'Customer_69', 'order_id': 6},
 {'name': 'Customer_691', 'order_id': 6},
 {'name': 'Customer_693', 'order_id': 7},
 {'name': 'Customer_694', 'order_id': 7},
 {'name': 'Customer_699', 'order_id': 9},
 {'name': 'Customer_700', 'order_id': 7},
 {'name': 'Customer_701', 'order_id': 6},
 {'name': 'Customer_702', 'order_id': 8},
 {'name': 'Customer_709', 'order_id': 6},
 {'name': 'Customer_718', 'order_id': 6},
 {'name': 'Customer_72', 'order_id': 6},
 {'name': 'Customer_720', 'order_id': 11},
 {'name': 'Customer_721', 'order_id': 8},
 {'name': 'Customer_722', 'order_id': 7},
 {'name': 'Customer_726', 'order_id': 14},
 {'name': 'Customer_728', 'order_id': 8},
 {'name': 'Customer_73', 'order_id': 13},
 {'name': 'Customer_731', 'order_id': 6},
 {'name': 'Customer_732', 'order_id': 7},
 {'name': 'Customer_733', 'order_id': 6},
 {'name': 'Customer_734', 'order_id': 6},
 {'name': 'Customer_736', 'order_id': 6},
 {'name': 'Customer_749', 'order_id': 7},
 {'name': 'Customer_75', 'order_id': 9},
 {'name': 'Customer_751', 'order_id': 7},
 {'name': 'Customer_753', 'order_id': 8},
 {'name': 'Customer_754', 'order_id': 7},
 {'name': 'Customer_758', 'order_id': 12},
 {'name': 'Customer_76', 'order_id': 8},
 {'name': 'Customer_761', 'order_id': 7},
 {'name': 'Customer_763', 'order_id': 6},
 {'name': 'Customer_768', 'order_id': 6},
 {'name': 'Customer_772', 'order_id': 7},
 {'name': 'Customer_776', 'order_id': 9},
 {'name': 'Customer_781', 'order_id': 6},
 {'name': 'Customer_783', 'order_id': 9},
 {'name': 'Customer_785', 'order_id': 9},
 {'name': 'Customer_787', 'order_id': 7},
 {'name': 'Customer_790', 'order_id': 7},
 {'name': 'Customer_791', 'order_id': 7},
 {'name': 'Customer_792', 'order_id': 6},
 {'name': 'Customer_794', 'order_id': 6},
 {'name': 'Customer_796', 'order_id': 6},
 {'name': 'Customer_8', 'order_id': 6},
 {'name': 'Customer_800', 'order_id': 7},
 {'name': 'Customer_802', 'order_id': 6},
 {'name': 'Customer_804', 'order_id': 8},
 {'name': 'Customer_807', 'order_id': 6},
 {'name': 'Customer_810', 'order_id': 6},
 {'name': 'Customer_817', 'order_id': 7},
 {'name': 'Customer_820', 'order_id': 6},
 {'name': 'Customer_822', 'order_id': 9},
 {'name': 'Customer_825', 'order_id': 11},
 {'name': 'Customer_83', 'order_id': 7},
 {'name': 'Customer_830', 'order_id': 7},
 {'name': 'Customer_832', 'order_id': 6},
 {'name': 'Customer_833', 'order_id': 11},
 {'name': 'Customer_834', 'order_id': 6},
 {'name': 'Customer_835', 'order_id': 6},
 {'name': 'Customer_836', 'order_id': 6},
 {'name': 'Customer_837', 'order_id': 6},
 {'name': 'Customer_840', 'order_id': 6},
 {'name': 'Customer_844', 'order_id': 6},
 {'name': 'Customer_846', 'order_id': 6},
 {'name': 'Customer_849', 'order_id': 11},
 {'name': 'Customer_850', 'order_id': 10},
 {'name': 'Customer_852', 'order_id': 8},
 {'name': 'Customer_853', 'order_id': 6},
 {'name': 'Customer_855', 'order_id': 9},
 {'name': 'Customer_856', 'order_id': 6},
 {'name': 'Customer_858', 'order_id': 10},
 {'name': 'Customer_864', 'order_id': 8},
 {'name': 'Customer_869', 'order_id': 7},
 {'name': 'Customer_87', 'order_id': 6},
 {'name': 'Customer_871', 'order_id': 6},
 {'name': 'Customer_872', 'order_id': 6},
 {'name': 'Customer_877', 'order_id': 6},
 {'name': 'Customer_88', 'order_id': 6},
 {'name': 'Customer_881', 'order_id': 10},
 {'name': 'Customer_883', 'order_id': 6},
 {'name': 'Customer_884', 'order_id': 9},
 {'name': 'Customer_886', 'order_id': 6},
 {'name': 'Customer_887', 'order_id': 6},
 {'name': 'Customer_889', 'order_id': 7},
 {'name': 'Customer_890', 'order_id': 8},
 {'name': 'Customer_891', 'order_id': 9},
 {'name': 'Customer_893', 'order_id': 6},
 {'name': 'Customer_897', 'order_id': 7},
 {'name': 'Customer_899', 'order_id': 7},
 {'name': 'Customer_90', 'order_id': 7},
 {'name': 'Customer_901', 'order_id': 6},
 {'name': 'Customer_902', 'order_id': 7},
 {'name': 'Customer_904', 'order_id': 6},
 {'name': 'Customer_909', 'order_id': 9},
 {'name': 'Customer_911', 'order_id': 6},
 {'name': 'Customer_912', 'order_id': 6},
 {'name': 'Customer_913', 'order_id': 7},
 {'name': 'Customer_914', 'order_id': 6},
 {'name': 'Customer_915', 'order_id': 7},
 {'name': 'Customer_917', 'order_id': 7},
 {'name': 'Customer_919', 'order_id': 7},
 {'name': 'Customer_920', 'order_id': 9},
 {'name': 'Customer_921', 'order_id': 9},
 {'name': 'Customer_923', 'order_id': 8},
 {'name': 'Customer_925', 'order_id': 12},
 {'name': 'Customer_929', 'order_id': 9},
 {'name': 'Customer_93', 'order_id': 9},
 {'name': 'Customer_930', 'order_id': 8},
 {'name': 'Customer_935', 'order_id': 6},
 {'name': 'Customer_936', 'order_id': 9},
 {'name': 'Customer_937', 'order_id': 10},
 {'name': 'Customer_938', 'order_id': 10},
 {'name': 'Customer_940', 'order_id': 8},
 {'name': 'Customer_942', 'order_id': 8},
 {'name': 'Customer_943', 'order_id': 6},
 {'name': 'Customer_944', 'order_id': 6},
 {'name': 'Customer_945', 'order_id': 9},
 {'name': 'Customer_946', 'order_id': 7},
 {'name': 'Customer_947', 'order_id': 10},
 {'name': 'Customer_950', 'order_id': 6},
 {'name': 'Customer_96', 'order_id': 7},
 {'name': 'Customer_962', 'order_id': 7},
 {'name': 'Customer_963', 'order_id': 9},
 {'name': 'Customer_968', 'order_id': 6},
 {'name': 'Customer_973', 'order_id': 9},
 {'name': 'Customer_974', 'order_id': 9},
 {'name': 'Customer_981', 'order_id': 6},
 {'name': 'Customer_984', 'order_id': 6},
 {'name': 'Customer_986', 'order_id': 6},
 {'name': 'Customer_988', 'order_id': 10},
 {'name': 'Customer_991', 'order_id': 6},
 {'name': 'Customer_992', 'order_id': 7}]

In [ ]:

For each month of the year, calculate the total revenue.

In [166]:
df_merged.head(1)

,customer_id,name,email,age,city,join_date,order_id,order_date,product_category,total_price,year,Month,Year-Month
0,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,82,2023-03-15,Electronics,388.0,2023,3,2023-3

In [154]:
df_merged['order_date'] = pd.to_datetime(df_merged['order_date'])

In [167]:
df_merged['year'] = df_merged['order_date'].dt.year

In [156]:
df_merged['Month'] = df_merged['order_date'].dt.month

In [165]:
df_merged['Year-Month'] = df_merged['year'].astype(str)+'-'+df_merged['Month'].astype(str)

In [182]:
rev_month_year = df_merged.groupby('Year-Month')['total_price'].sum().reset_index()
rev_month_year

   Year-Month  total_price
0      2022-1     51660.83
1     2022-10     51048.24
2     2022-11     56021.95
3     2022-12     47582.06
4      2022-2     48645.59
5      2022-3     59214.04
6      2022-4     56304.86
7      2022-5     53122.75
8      2022-6     54118.21
9      2022-7     53473.15
10     2022-8     55460.04
11     2022-9     49267.99
12     2023-1     51969.58
13    2023-10     54680.22
14    2023-11     55287.34
15    2023-12     54821.20
16     2023-2     45671.69
17     2023-3     54905.58
18     2023-4     51017.47
19     2023-5     49037.58
20     2023-6     55164.97
21     2023-7     56976.16
22     2023-8     57901.75
23     2023-9     54011.55

In [183]:
revmonyear = rev_month_year.to_dict('records')
revmonyear

[{'Year-Month': '2022-1', 'total_price': 51660.83},
 {'Year-Month': '2022-10', 'total_price': 51048.24},
 {'Year-Month': '2022-11', 'total_price': 56021.95},
 {'Year-Month': '2022-12', 'total_price': 47582.06},
 {'Year-Month': '2022-2', 'total_price': 48645.59},
 {'Year-Month': '2022-3', 'total_price': 59214.04},
 {'Year-Month': '2022-4', 'total_price': 56304.86},
 {'Year-Month': '2022-5', 'total_price': 53122.75},
 {'Year-Month': '2022-6', 'total_price': 54118.21},
 {'Year-Month': '2022-7', 'total_price': 53473.15},
 {'Year-Month': '2022-8', 'total_price': 55460.04},
 {'Year-Month': '2022-9', 'total_price': 49267.99},
 {'Year-Month': '2023-1', 'total_price': 51969.58},
 {'Year-Month': '2023-10', 'total_price': 54680.22},
 {'Year-Month': '2023-11', 'total_price': 55287.340000000004},
 {'Year-Month': '2023-12', 'total_price': 54821.2},
 {'Year-Month': '2023-2', 'total_price': 45671.69},
 {'Year-Month': '2023-3', 'total_price': 54905.58},
 {'Year-Month': '2023-4', 'total_price': 51017.47},
 {'Year-Month': '2023-5', 'total_price': 49037.58},
 {'Year-Month': '2023-6', 'total_price': 55164.97},
 {'Year-Month': '2023-7', 'total_price': 56976.16},
 {'Year-Month': '2023-8', 'total_price': 57901.75},
 {'Year-Month': '2023-9', 'total_price': 54011.55}]

In [ ]:
Find the average total_price of orders for customers older than 40.

In [184]:
df_merged.head(1)

,customer_id,name,email,age,city,join_date,order_id,order_date,product_category,total_price,year,Month,Year-Month
0,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,82,2023-03-15,Electronics,388.0,2023,3,2023-3

In [188]:
total_price_orders = df_merged.groupby('order_id')['total_price'].sum()
total_price_orders

order_id
1        28.92
2        72.86
3       120.07
4       407.44
5       440.47
         ...
4996    302.71
4997     88.58
4998    151.80
4999    311.17
5000    279.28
Name: total_price, Length: 5000, dtype: float64

In [191]:
filter_40 = total_price_orders[total_price_orders > 40].reset_index()
filter_40

      order_id  total_price
0            2        72.86
1            3       120.07
2            4       407.44
3            5       440.47
4            6        45.01
...        ...          ...
4701      4996       302.71
4702      4997        88.58
4703      4998       151.80
4704      4999       311.17
4705      5000       279.28

[4706 rows x 2 columns]

In [194]:
total_revenue_greaterthan_40 = filter_40.to_dict('records')

## Product and Revenue Analysis:

In [ ]:
What is the total revenue for each product category?

In [196]:
df_merged.head(1)

,customer_id,name,email,age,city,join_date,order_id,order_date,product_category,total_price,year,Month,Year-Month
0,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,82,2023-03-15,Electronics,388.0,2023,3,2023-3

In [202]:
total_rev_cat = df_merged.groupby('product_category')['total_price'].sum().reset_index().round(2)
total_rev_cat

  product_category  total_price
0          Apparel    319685.88
1            Books    306464.12
2      Electronics    315515.49
3       Home Goods    335699.31

In [203]:
total_revenue_per_categeory = total_rev_cat.to_dict('records')

- What are the top 3 product categories by revenue?

In [208]:
rev_cat =  df_merged.groupby('product_category')['total_price'].sum()

In [213]:
rc = rev_cat.nlargest(3).reset_index()
rc

  product_category  total_price
0       Home Goods    335699.31
1          Apparel    319685.88
2      Electronics    315515.49

In [212]:
cr = rc.to_dict('records')

In [ ]:
What is the total number of orders for each product category?

In [214]:
df_merged.head(1)

,customer_id,name,email,age,city,join_date,order_id,order_date,product_category,total_price,year,Month,Year-Month
0,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,82,2023-03-15,Electronics,388.0,2023,3,2023-3

In [216]:
oders_products = df_merged.groupby('product_category')['order_id'].sum()
oders_products.reset_index()

  product_category  order_id
0          Apparel   3157146
1            Books   3006506
2      Electronics   3049402
3       Home Goods   3289446

In [ ]:
orders_per_product_category = oders_products.to_dict('results')

## 2. Customer Demographics Analysis:

In [ ]:
•
What is the average age of customers in each city?

In [219]:
df_merged.head(1)

,customer_id,name,email,age,city,join_date,order_id,order_date,product_category,total_price,year,Month,Year-Month
0,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,82,2023-03-15,Electronics,388.0,2023,3,2023-3

In [223]:
age_city = df_merged.groupby('city')['age'].mean().sort_values().round(2)
age_city

city
Los Angeles    42.26
Chicago        43.40
Houston        43.79
Phoenix        44.12
New York       44.69
Name: age, dtype: float64

In [224]:
av_age_city = age_city.reset_index()

In [225]:
average_age_per_city = av_age_city.to_dict('records')

•
### What are the top 3 cities by total number of orders?

In [227]:
cityorders = df_merged.groupby('city')['order_id'].sum()

In [228]:
top3cities = cityorders.nlargest(3)

In [229]:
top3cities.reset_index()

       city  order_id
0  New York   2594967
1   Houston   2537481
2   Phoenix   2536799

### Find the median age of customers who have made at least one order.

In [230]:
df_merged.head(1)

,customer_id,name,email,age,city,join_date,order_id,order_date,product_category,total_price,year,Month,Year-Month
0,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,82,2023-03-15,Electronics,388.0,2023,3,2023-3

In [231]:
age_orders = df_merged.groupby('age')['order_id'].mean()

In [236]:
filter_age = age_orders[age_orders >= 1].round(2).reset_index

In [238]:
average_age_with_1_order = filter_age.to_dict('records')

AttributeError: 'function' object has no attribute 'to_dict'

## 1.Customer and Order Summary:

### How many unique customers are there?

In [239]:
df_merged.head(1)

,customer_id,name,email,age,city,join_date,order_id,order_date,product_category,total_price,year,Month,Year-Month
0,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,82,2023-03-15,Electronics,388.0,2023,3,2023-3

In [241]:
unique_customers = df_merged['name'].nunique()
unique_customers

990

### What is the total revenue generated from all orders?

In [243]:
revenue_orders = df_merged.groupby('order_id')['total_price'].sum()
revenue_orders.reset_index()

      order_id  total_price
0            1        28.92
1            2        72.86
2            3       120.07
3            4       407.44
4            5       440.47
...        ...          ...
4995      4996       302.71
4996      4997        88.58
4997      4998       151.80
4998      4999       311.17
4999      5000       279.28

[5000 rows x 2 columns]

### What is the average order value (AOV)?

In [244]:
df_merged.head(1)

,customer_id,name,email,age,city,join_date,order_id,order_date,product_category,total_price,year,Month,Year-Month
0,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,82,2023-03-15,Electronics,388.0,2023,3,2023-3

In [245]:
total_orders = df_merged['order_id']

In [246]:
total_revenue = df_merged['total_price']

In [249]:
aov = total_revenue / total_orders
aov.reset_index()

      index         0
0         0  4.731707
1         1  0.257688
2         2  0.109540
3         3  0.220399
4         4  0.096501
...     ...       ...
4995   4995  0.118623
4996   4996  0.006562
4997   4997  0.068079
4998   4998  0.151475
4999   4999  0.075265

[5000 rows x 2 columns]

In [253]:
df_merged['product_category'].value_counts(normalize=True)

product_category
Home Goods     0.2646
Electronics    0.2478
Apparel        0.2470
Books          0.2406
Name: proportion, dtype: float64

In [251]:
df_merged.head(1)

,customer_id,name,email,age,city,join_date,order_id,order_date,product_category,total_price,year,Month,Year-Month
0,1,Customer_1,customer_1@example.com,56,Chicago,2022-08-04,82,2023-03-15,Electronics,388.0,2023,3,2023-3

In [254]:
df_merged.groupby('product_category').size()

product_category
Apparel        1235
Books          1203
Electronics    1239
Home Goods     1323
dtype: int64

In [260]:
df_merged['product_category'].value_counts().head(1)

product_category
Home Goods    1323
Name: count, dtype: int64

In [259]:
df_merged['product_category'].unique()

array(['Electronics', 'Books', 'Apparel', 'Home Goods'], dtype=object)

In [267]:
df_merged[df_merged['city'].str.contains('New')]

,customer_id,name,email,age,city,join_date,order_id,order_date,product_category,total_price,year,Month,Year-Month
10,3,Customer_3,customer_3@example.com,46,New York,2022-05-06,1043,2022-01-04,Apparel,352.45,2022,1,2022-1
11,3,Customer_3,customer_3@example.com,46,New York,2022-05-06,1257,2023-03-02,Home Goods,58.21,2023,3,2023-3
12,3,Customer_3,customer_3@example.com,46,New York,2022-05-06,2026,2023-07-21,Home Goods,391.46,2023,7,2023-7
13,3,Customer_3,customer_3@example.com,46,New York,2022-05-06,2289,2023-05-15,Electronics,153.70,2023,5,2023-5
14,3,Customer_3,customer_3@example.com,46,New York,2022-05-06,4950,2022-04-09,Electronics,450.69,2022,4,2022-4
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4978,993,Customer_993,customer_993@example.com,64,New York,2022-09-17,2476,2022-03-20,Apparel,273.13,2022,3,2022-3
4979,994,Customer_994,customer_994@example.com,40,New York,2022-04-12,1483,2022-02-18,Books,311.23,2022,2,2022-2
4980,994,Customer_994,customer_994@example.com,40,New York,2022-04-12,2556,2023-01-14,Electronics,223.77,2023,1,2023-1
4981,994,Customer_994,customer_994@example.com,40,New York,2022-04-12,3530,2022-06-12,Home Goods,279.94,2022,6,2022-6
4982,994,Customer_994,customer_994@example.com,40,New York,2022-04-12,4474,2022-02-28,Books,71.60,2022,2,2022-2

In [268]:
len(df_merged[(df_merged['product_category'] == 'Apparel') & (df_merged['total_price'] < 50)])

94

In [270]:

df_merged.groupby('product_category').size()

product_category
Apparel        1235
Books          1203
Electronics    1239
Home Goods     1323
dtype: int64